<template>
  <div style="padding: 10px;">
	  <div>
	  	    <h1>《蛋小厨隐私政策》</h1>
	  		<h3>生效日期：2022-09-01</h3>
	  		<h3>应用名称：蛋小厨外卖点餐软件[简称：蛋小厨]</h3>
	  		<h3>应用开发者名称：江苏永信信息技术有限公司</h3>
	  <div>蛋小厨 App 尊重并保护所有使用服务用户的个人隐私权。但蛋小厨 App 将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，蛋小厨 App 不会将这些信息对外披露或向第三方提供。蛋小厨 App 会不时更新本隐私权政策。 您在同意蛋小厨 App 服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于蛋小厨 App 服务使用协议不可分割的一部分。 
	  </div>
	  <h4>1. 适用范围</h4>
	  a) 在您注册蛋小厨 App 帐号时，您根据蛋小厨 App 要求提供的个人注册息； <br>
	  b) 在您使用蛋小厨 App 网络服务，或访问蛋小厨 App 平台网页时，蛋小厨 App 自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据； <br>
	  c) 蛋小厨 App 通过合法途径从商业伙伴处取得的用户个人数据。 <br>
	  您了解并同意，以下信息不适用本隐私权政策： <br>
	  a) 您在使用蛋小厨 App 平台提供的搜索服务时输入的关键字信息；<br> 
	  b) 蛋小厨 App 收集到的您在蛋小厨 App 发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情； <br>
	  c) 违反法律规定或违反蛋小厨 App 规则行为及蛋小厨 App 已对您采取的措
	  施。 <br>
	  <h4>2. 信息使用 </h4>
	  a) 蛋小厨 App 不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和蛋小厨 App （含蛋小厨 App 关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。<br> 
	  b) 蛋小厨 App 亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何蛋小厨 App 平台用户如从事上述活动，一经发现，蛋小厨 App 有权立即终止与该用户的服务协议。 <br>
	  <h4>3. 信息披露</h4> 
	  在如下情况下，蛋小厨 App 将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：<br> 
	  a) 经您事先同意，向第三方披露； <br>
	  b) 为提供您所要求的产品和服务，而必须和第三方分享您的个人信息； <br>
	  c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；<br>
	  d) 如您出现违反中国有关法律、法规或者蛋小厨 App 服务协议或相关规则的情况，需要向第三方披露；  <br>
	  e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；<br>
	  f) 在蛋小厨 App 平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，蛋小厨 App 有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。<br>  
	  g) 其它蛋小厨 App 根据法律、法规或者网站政策认为合适的披露。  <br>
	  h)我们通过用户输入手机号的方式手机用户的手机号码，用于用户在蛋小厨平台创建账号使用。 <br>
	  <h4>4. 信息存储和交换 </h4>  
	  蛋小厨 App 收集的有关您的信息和资料将保存在蛋小厨 App 及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或蛋小厨 App 收集信息和资料所在地的境外并在境外被访问、存储和展示。 <br>
	  <h4>5. Cookie的使用</h4>  
	  a) 在您未拒绝接受cookies的情况下，蛋小厨 App 会在您的计算机上设定或取用cookies，以便您能登录或使用依赖于cookies的蛋小厨 App 平台服务或功能。<br>
	  b) 您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的蛋小厨 App 网络服务或功能。 <br>
	  c) 通过蛋小厨 App 所设cookies所取得的有关信息，将适用本政策。  <br>
	  <h4>6. 信息安全  </h4>
	  a) 蛋小厨 App 帐号均有安全保护功能，请妥善保管您的用户名及密码信息。蛋小厨 App 将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。  
	  <br>b) 在使用蛋小厨 App 网络服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是蛋小厨 App 用户名及密码发生泄露，请您立即联络蛋小厨 App 客服，以便蛋小厨 App 采取相应措施。
	  <br>c) 账号注销流程：1、用户注销账号表示放弃中相关的订单、评论等各类信息，账号注销后app所有的信息将被全部删除。2、登陆的用户可以通过【我的】-【右上角设置图标】-【注销账号】按钮注销当前账号。
	  <h4>7. 其他</h4>
	  <br>a) 我们的应用需要手机用户的ANDROID ID相关信息，便于向相互推送信息，当用户在应用内购买产品时候，产品的订单信息发生变化的时候，应用需要向用户推送相关订单信息。
	  <br>b)我们的产品基于DCloud uni-app(5+ App/Wap2App)开发，应用运行期间需要收集您的设备唯一识别码（IMEI/android ID/DEVICE_ID/IDFA、SIM 卡 IMSI 信息、OAID）以提供统计分析服务，并通过应用启动数据及异常错误日志分析改进性能和用户体验，为用户提供更好的服务。
	  <br>c)我们应用内集成的[个推、个数应用统计、个像]SDK获取软件安装列表,MAC地址】等为用户提供消息统计分析服务，能更好的改进用户体验和性能。
	  <h4>8. 第三方sdk</h4>
	  我们会对接入的第三方sdk进行严格检测，并对您及时公开说明接入sdk的最新情况，具体请以第三方sdk的官方隐私政策为准。
	  <br>第三方sdk名称：个推
	  <br>使用目的：向用户推送应用内消息
	  <br>使用方式：推送消息
	  <br>第三方sdk名称：个数应用统计
	  <br>使用目的：向用户推送应用消息统计
	  <br>使用方式：推送消息
	  <br>第三方sdk名称：个像
	  <br>使用目的：推送消息
	  <br>使用方式：推送消息
	  <br/>第三方sdk名称：weex,数字天堂SDK
	  <br/>使用目的：收集设备MAC地址、软件安装列表用于统计分析，便于为您提供更加精细化服务
	  <br/>使用方式：获取用户的mac地址，软件安装列表
	  <br/>第三方sdk名称：weex,数字天堂SDK
	  <br/>使用范围：获取设备传感器
	  <br/>使用方式：获取设备传感器为了更加精准的为用户提供服务
	  <br/>第三方sdk名称：com.loc.et,com.loc.ej
	  <br/>使用范围：获取基站定位
	  <br/>使用方式：获取基站定位为了向用户推荐附件美食
	  <br/>第三方sdk名称：com.loc.et,com.loc.ej,com.loc
	  <br/>使用范围：获取基站定位
	  <br/>使用方式：获取基站定位为了向用户推荐附件美食
	  <br/>第三方sdk名称：com.loc.eq,com.loc.ej
	  <br/>使用范围：获取设备传感器
	  <br/>使用方式：获取设备传感器为了更加精准的为用户提供服务
	  <br/>第三方sdk名称：Gtc,com.igexin.push
	  <br/>使用范围：收集SD卡数据
	  <br/>使用方式：获取设备传感器为了更加精准的为用户提供消息服务
	  
	  <br/>第三方sdk名称：com.xiaomi.mipush
	  <br/>使用范围：向用户推送应用内消息
	  <br/>使用方式：推送消息
	  <br/>第三方sdk名称：com.heytap.mcs
	  <br/>使用范围：向用户推送应用内消息
	  <br/>使用方式：推送消息
	  <br/>第三方sdk名称：com.heytap.msp
	  <br/>使用范围：向用户推送应用内消息
	  <br/>使用方式：推送消息
	  <br/>第三方sdk名称：com.xiaomi.push
	  <br/>使用范围：向用户推送应用内消息
	  <br/>使用方式：推送消息
	  <br/>第三方sdk名称：com.amap.api
	  <br/>使用范围：用户可以查看周边地图信息
	  <br/>使用方式：用户在地图查看自己的位置信息
	  
	  <h4>9. 隐私问题</h4>
	  如果你对本公司的隐私政策或数据处理有任何问题或顾虑，请通过邮箱
	  310327860@qq.com与本公司联系。
	  	</div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      url: ''
    }
  },
  onLoad(item) {
    this.url = decodeURIComponent(item.url)
    console.log(this.url)
    // 传入需要跳转的链接 使用web-view标签进行跳转
  }
}
</script>

<style lang="scss">
</style>

